/**
 * 一只青蛙一次可以跳上1级台阶，也可以跳上2级台阶。求该青蛙跳上一个 n 级的台阶总共有多少种跳法。
 *答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。
 * @param {number} n
 * @return {number}
 */

/**
 * dp[x]: 第x阶台阶的跳法数
 */
var numWays = function (n) {
  let dp = [1, 1]
  // let steps = [1, 2]
  let i = 2;
  while (i <= n) {
    dp[i] = (dp[i - 1] + dp[i - 2]) % 1000000007
    ++i
  }
  return dp[n]
};


/**
 * dp 1 = 1                                 [1]
 * dp 2 = 2                                 [1,1; 2]
 * dp 3 = 3                                 [1,1,1; 1,2; 2,1]
 * dp 4 = 5                                 [(1,1,1),1; (1,2),1; (2,1),1; (1,1),2; (2),2] dp[3] +dp[2]
 * dp 5 = dp[4] + dp[3]
 */